; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v2)
		(pred_1 ?v8)
		(pred_3 ?v3)
		(pred_2 ?v3)
		(pred_6 ?v8 ?v3)
		(pred_5)
		(pred_4 ?v8))

   (:action op_1
       :parameters  (?v7 ?v6)
       :precondition (and (not-eq ?v7 ?v6) 
                          (pred_3 ?v7) (pred_3 ?v6) (pred_2 ?v7))
       :effect (and  (pred_2 ?v6)
		     (not (pred_2 ?v7))))


   (:action op_3
       :parameters (?v5 ?v4)
       :precondition  (and  (pred_1 ?v5) (pred_3 ?v4)
			    (pred_6 ?v5 ?v4) (pred_2 ?v4) (pred_5))
       :effect (and (pred_4 ?v5)
		    (not (pred_6 ?v5 ?v4)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v5  ?v4)
       :precondition  (and  (pred_1 ?v5) (pred_3 ?v4)
			    (pred_4 ?v5) (pred_2 ?v4))
       :effect (and (pred_6 ?v5 ?v4)
		    (pred_5)
		    (not (pred_4 ?v5)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_01 obj_02 obj_05 obj_06 
          obj_04 obj_03 
)
(:init
(pred_3 obj_01)
(pred_3 obj_02)
(pred_3 obj_05)
(pred_3 obj_06)
(pred_1 obj_04)
(pred_1 obj_03)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(pred_5)
(pred_6 obj_04 obj_02)
(pred_6 obj_03 obj_06)
(pred_2 obj_06)
)
(:goal
(and
(pred_6 obj_04 obj_01)
(pred_6 obj_03 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_04 obj_01) (pred_2 obj_05))
    (sometime-before  (pred_6 obj_03 obj_01) (pred_2 obj_02))
  )
)
)

; plan
1. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_03 obj_06) (pred_5)
   added: (pred_4 obj_03)
   goals met: 0 of 2
2. (op_1 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 0 of 2
3. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_05) (pred_5)
   goals met: 0 of 2
4. (op_1 obj_05 obj_02)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_02)
   goals met: 0 of 2
5. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04 obj_02) (pred_5)
   added: (pred_4 obj_04)
   goals met: 0 of 2
6. (op_1 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_01)
   goals met: 0 of 2
7. (op_2 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_01) (pred_5)
   goals met: 1 of 2
8. (op_1 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_05)
   goals met: 1 of 2
9. (op_3 obj_03 obj_05)
   deleted: (pred_6 obj_03 obj_05) (pred_5)
   added: (pred_4 obj_03)
   goals met: 1 of 2
10. (op_1 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_01)
   goals met: 1 of 2
11. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_01) (pred_5)
   goals met: 2 of 2
